#+TITLE: Using waf to produce a tarball for submission to the arXiv.
#+DATE: [2014-03-08 Sat 14:44]
#+DESCRIPTION: 
#+SETUPFILE: ~/org-pub/topics/setup.org


This topic discusses using =waf= to produce a tarball from a waf-built LaTeX source area which is suitable for submission to the [[http://www.arxiv.org][arXiv]].

* Testing

As mentioned the =waf distcheck= doesn't seem to honor the tar file produced by =waf dist= and anyways this approach does not use =dist=.  So, testing is done by "hand".

#+BEGIN_SRC sh :shebang #!/bin/bash :results value code :exports both :wrap EXAMPLE 
  tar -xvf build/document-0.0.0.tar.gz
  pushd document-0.0.0/ 
  pdflatex document.tex > /dev/null
  pdflatex document.tex > /dev/null
  ls -l
  popd
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
document-0.0.0/document-bib.bbl
document-0.0.0/document.tex
document-0.0.0/figs/waf-logo.png
document-0.0.0/main.tex
document-0.0.0/preamble.tex
~/org-pub/topics/waf-latex-arxiv/document-0.0.0 ~/org-pub/topics/waf-latex-arxiv
total 100
-rw-r--r-- 1 bv bv   281 Mar  8 19:15 document.aux
-rw-r--r-- 1 bv bv   410 Mar  8 19:11 document-bib.bbl
-rw-r--r-- 1 bv bv  7131 Mar  8 19:15 document.log
-rw-r--r-- 1 bv bv 67452 Mar  8 19:15 document.pdf
-rw-r--r-- 1 bv bv   150 Mar  8 15:46 document.tex
drwxr-xr-x 2 bv bv  4096 Mar  8 19:15 figs
-rw-r--r-- 1 bv bv   184 Mar  8 18:16 main.tex
-rw-r--r-- 1 bv bv    42 Mar  8 15:46 preamble.tex
~/org-pub/topics/waf-latex-arxiv
#+END_EXAMPLE

